Белгипрозем_2017/src/InformationRegisters/ЗначенияУсловийПриОбработкеПисем/ЗначенияУсловийПриОбработкеПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияУсловийПриОбработкеПисем</name>
  <dimensions>
    <name>ВидУсловия</name>
    <type>
      <types>EnumRef.ВидыУсловийОтбораИсходящихПисем</types>
      <types>EnumRef.ВидыДействийПриОбработкеИсходящихПисем</types>
      <types>EnumRef.ВидыУсловийОтбораВходящихПисем</types>
      <types>EnumRef.ВидыДействийПриОбработкеВходящихПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.ПравилаОбработкиПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУсловия</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>Boolean</types>
      <types>CatalogRef.Должности</types>
      <types>String</types>
      <types>CatalogRef.ПапкиПисем</types>
      <types>CatalogRef.СпискиАдресовЭлектроннойПочты</types>
      <types>Date</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>EnumRef.ФлагиОбъектов</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоЗначенияИсключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/ЗначенияДействийПриОбработкеПисем/ЗначенияДействийПриОбработкеПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияДействийПриОбработкеПисем</name>
  <resources>
    <name>ПараметрДействия</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>Boolean</types>
      <types>CatalogRef.Должности</types>
      <types>String</types>
      <types>CatalogRef.ПапкиПисем</types>
      <types>CatalogRef.СпискиАдресовЭлектроннойПочты</types>
      <types>Date</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>EnumRef.ФлагиОбъектов</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстАвтоответа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидДействия</name>
    <type>
      <types>EnumRef.ВидыУсловийОтбораИсходящихПисем</types>
      <types>EnumRef.ВидыДействийПриОбработкеИсходящихПисем</types>
      <types>EnumRef.ВидыУсловийОтбораВходящихПисем</types>
      <types>EnumRef.ВидыДействийПриОбработкеВходящихПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.ПравилаОбработкиПисем</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/СведенияОПрочтении/СведенияОПрочтении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПрочтении</name>
  <resources>
    <name>Прочтен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/ФлагиОбъектов/ФлагиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФлагиОбъектов</name>
  <resources>
    <name>Флаг</name>
    <type>
      <types>EnumRef.ФлагиОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ВариантыПримененияПравилаПисем/ВариантыПримененияПравилаПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПримененияПравилаПисем</name>
  <enumValues>
    <name>КоВсемПисьмам</name>
  </enumValues>
  <enumValues>
    <name>ТолькоКНепрочитаннымПисьмам</name>
  </enumValues>
  <enumValues>
    <name>ТолькоКПрочитаннымПисьмам</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ВидыУсловийОтбораВходящихПисем/ВидыУсловийОтбораВходящихПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУсловийОтбораВходящихПисем</name>
  <enumValues>
    <name>ТемаСодержитУказанныеСлова</name>
  </enumValues>
  <enumValues>
    <name>АдресОтправителяСодержитУказанныеСлова</name>
  </enumValues>
  <enumValues>
    <name>ОтправительВходитВГруппы</name>
  </enumValues>
  <enumValues>
    <name>АдресОтправителяВСписке</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоНаУказанныеАдреса</name>
  </enumValues>
  <enumValues>
    <name>ПолучательВходитВГруппы</name>
  </enumValues>
  <enumValues>
    <name>ТекстСодержитУказанныеСлова</name>
  </enumValues>
  <enumValues>
    <name>ПолученоВТечениеУказанногоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИмеетВложения</name>
  </enumValues>
  <enumValues>
    <name>АдресованоМне</name>
  </enumValues>
  <enumValues>
    <name>АдресованоТолькоМне</name>
  </enumValues>
  <enumValues>
    <name>ТемаНачинаетсяС</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>БылНаправленОтвет</name>
  </enumValues>
  <enumValues>
    <name>НаходитсяВПапке</name>
  </enumValues>
  <enumValues>
    <name>БылоПереслано</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ВидыУсловийОтбораИсходящихПисем/ВидыУсловийОтбораИсходящихПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУсловийОтбораИсходящихПисем</name>
  <enumValues>
    <name>ТемаСодержитУказанныеСлова</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоНаУказанныеАдреса</name>
  </enumValues>
  <enumValues>
    <name>ПолучательВходитВГруппы</name>
  </enumValues>
  <enumValues>
    <name>ТекстСодержитУказанныеСлова</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоВТечениеУказанногоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИмеетВложения</name>
  </enumValues>
  <enumValues>
    <name>ТолькоДляПользователей</name>
  </enumValues>
  <enumValues>
    <name>ЯвляетсяОтветомНаПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ПересылаетВходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ПересылаетИсходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ТемаНачинаетсяС</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>БылНаправленОтвет</name>
  </enumValues>
  <enumValues>
    <name>БылоПереслано</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ТипыОтвета/ТипыОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОтвета</name>
  <enumValues>
    <name>ОтветНаПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ПересылкаПисьма</name>
  </enumValues>
  <enumValues>
    <name>ПеренаправлениеПисьма</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ВидыДействийПриОбработкеВходящихПисем/ВидыДействийПриОбработкеВходящихПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействийПриОбработкеВходящихПисем</name>
  <enumValues>
    <name>ПереместитьВУказаннуюПапку</name>
  </enumValues>
  <enumValues>
    <name>УстановитьУказанныйФлаг</name>
  </enumValues>
  <enumValues>
    <name>УстановитьПометкуПрочтения</name>
  </enumValues>
  <enumValues>
    <name>ОтветитьСУказаннымТекстом</name>
  </enumValues>
  <enumValues>
    <name>ПометитьНаУдаление</name>
  </enumValues>
  <enumValues>
    <name>ОстановитьПроверкуДругихПравил</name>
  </enumValues>
  <enumValues>
    <name>УстановитьУказанныйПроект</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ВидыДействийПриОбработкеИсходящихПисем/ВидыДействийПриОбработкеИсходящихПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействийПриОбработкеИсходящихПисем</name>
  <enumValues>
    <name>ПереместитьВУказаннуюПапку</name>
  </enumValues>
  <enumValues>
    <name>УстановитьУказанныйФлаг</name>
  </enumValues>
  <enumValues>
    <name>ПоместитьИсходноеПисьмоВУказаннуюПапку</name>
  </enumValues>
  <enumValues>
    <name>ОстановитьПроверкуДругихПравил</name>
  </enumValues>
  <enumValues>
    <name>ПрименитьКИсходномуПисьмуПравила</name>
  </enumValues>
  <enumValues>
    <name>ПереместитьВПапкуИсходногоПисьма</name>
  </enumValues>
  <enumValues>
    <name>УстановитьУказанныйПроект</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/CommonModules/РаботаСПравиламиОбработкиПисем/Module.bsl
Процедура ПрименитьПравилоКПапке(
		ПравилоСсылка, 
		ПапкаСсылка, 
		ВключатьПодпапки, 
		ВариантПримененияПравила,
		ВыводитьСообщения) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияУсловийПриОбработкеПисем.Правило,
		|	ЗначенияУсловийПриОбработкеПисем.ПараметрУсловия КАК Параметр,
		|	ЗначенияУсловийПриОбработкеПисем.ВидУсловия КАК Вид,
		|	ЗначенияУсловийПриОбработкеПисем.Порядок КАК Порядок,
		|	ЗначенияУсловийПриОбработкеПисем.ЭтоЗначенияИсключения КАК ЭтоЗначенияИсключения,
		|	NULL КАК ТекстАвтоответа
		|ИЗ
		|	РегистрСведений.ЗначенияУсловийПриОбработкеПисем КАК ЗначенияУсловийПриОбработкеПисем
		|ГДЕ
		|	ЗначенияУсловийПриОбработкеПисем.Правило = &Правило
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияУсловийПриОбработкеПисем.ВидУсловия,
		|	ЗначенияУсловийПриОбработкеПисем.Правило,
		|	ЗначенияУсловийПриОбработкеПисем.ПараметрУсловия,
		|	ЗначенияУсловийПриОбработкеПисем.Порядок,
		|	ЗначенияУсловийПриОбработкеПисем.ЭтоЗначенияИсключения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗначенияДействийПриОбработкеПисем.Правило,
		|	ЗначенияДействийПриОбработкеПисем.ПараметрДействия,
		|	ЗначенияДействийПриОбработкеПисем.ВидДействия,
		|	0,
		|	ЛОЖЬ,
		|	ЗначенияДействийПриОбработкеПисем.ТекстАвтоответа
		|ИЗ
		|	РегистрСведений.ЗначенияДействийПриОбработкеПисем КАК ЗначенияДействийПриОбработкеПисем
		|ГДЕ
		|	ЗначенияДействийПриОбработкеПисем.Правило = &Правило
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		
	Запрос.УстановитьПараметр("Правило", ПравилоСсылка);
	ТаблицаПараметров = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Если ВключатьПодпапки Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭлектроннаяПочта.Ссылка
		|ИЗ
		|	ЖурналДокументов.ЭлектроннаяПочта КАК ЭлектроннаяПочта
		|ГДЕ
		|	ЭлектроннаяПочта.Папка В ИЕРАРХИИ(&Папка)
		|	И ЭлектроннаяПочта.ПометкаУдаления = ЛОЖЬ";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭлектроннаяПочта.Ссылка
		|ИЗ
		|	ЖурналДокументов.ЭлектроннаяПочта КАК ЭлектроннаяПочта
		|ГДЕ
		|	ЭлектроннаяПочта.Папка = &Папка
		|	И ЭлектроннаяПочта.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Папка", ПапкаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Сч = 0;
		КоличествоИтераций = Выборка.Количество();
		Пока Выборка.Следующий() Цикл
			Сч = Сч + 1;
			Если ВариантПримененияПравила <> Перечисления.ВариантыПримененияПравилаПисем.КоВсемПисьмам Тогда
				
				Прочтен = РегистрыСведений.СведенияОПрочтении.ОбъектБылПрочтен(Выборка.Ссылка);
				
				Если ВариантПримененияПравила = Перечисления.ВариантыПримененияПравилаПисем.ТолькоКПрочитаннымПисьмам
					И Не Прочтен
					ИЛИ ВариантПримененияПравила = Перечисления.ВариантыПримененияПравилаПисем.ТолькоКНепрочитаннымПисьмам
					И Прочтен Тогда
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			Попытка
								
				ДействияВыполнялись = Ложь;
				НеобходимоЗаписатьПисьмо = Ложь;
				Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ВходящееПисьмо") И ПравилоСсылка.ДляВходящихПисем Тогда
					
					РеквизитыПисьма = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(
						Выборка.Ссылка, 
						"Тема, 
						|ОтправительАдресат, 
						|ТекстПисьмаHTMLХранилище, 
						|ТекстПисьмаПростойТекстХранилище, 
						|ТекстПисьмаРазмеченныйТекстХранилище,
						|ДатаПолучения,
						|ЕстьВложения,
						|УчетнаяЗапись,
						|Ссылка"); 
								
					Если ВстроеннаяПочтаСервер.ПроверитьУсловияПравилаДляВходящих(
								Выборка.Ссылка, 
								ПравилоСсылка.Ссылка, 
								ТаблицаПараметров, 
								РеквизитыПисьма, 
								Ложь) 
						И НЕ ВстроеннаяПочтаСервер.ПроверитьУсловияПравилаДляВходящих(
							Выборка.Ссылка, 
							ПравилоСсылка.Ссылка, 
							ТаблицаПараметров, 
							РеквизитыПисьма, 
							Истина) Тогда
						
						ПисьмоОбъект = Выборка.Ссылка.ПолучитьОбъект();
						ВстроеннаяПочтаСервер.ВыполнитьДействияПравилаДляВходящих(ПисьмоОбъект, ПравилоСсылка.Ссылка, ТаблицаПараметров, ДействияВыполнялись, НеобходимоЗаписатьПисьмо);
						Если ДействияВыполнялись И НеобходимоЗаписатьПисьмо Тогда
							ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
							ПисьмоОбъект.Записать();
							РазблокироватьДанныеДляРедактирования(Выборка.Ссылка);
						КонецЕсли;
						
					КонецЕсли;
				ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ИсходящееПисьмо") И ПравилоСсылка.ДляИсходящихПисем Тогда
					ДополнительныеСвойстваОбъекта = Новый Структура;
					РеквизитыПисьма = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(
						Выборка.Ссылка, 
						"Тема, 
						|ОтправительКонтакт, 
						|ТекстПисьмаHTMLХранилище, 
						|ТекстХранилище, 
						|ДатаОтправки,
						|ЕстьВложения,
						|УчетнаяЗапись,
						|Ссылка,
						|ТипОтвета,
						|ПисьмоОснование");
					Если ВстроеннаяПочтаСервер.ПроверитьУсловияПравилаДляИсходящих(
							Выборка.Ссылка, 
							ПравилоСсылка.Ссылка, 
							ТаблицаПараметров, 
							РеквизитыПисьма, 
							Ложь, 
							ДополнительныеСвойстваОбъекта) 
						И НЕ ВстроеннаяПочтаСервер.ПроверитьУсловияПравилаДляИсходящих(
							Выборка.Ссылка, 
							ПравилоСсылка.Ссылка, 
							ТаблицаПараметров, 
							РеквизитыПисьма, 
							Истина, 
							ДополнительныеСвойстваОбъекта) Тогда
						
						ПисьмоОбъект = Выборка.Ссылка.ПолучитьОбъект();
						Для Каждого КлючЗначение Из ДополнительныеСвойстваОбъекта Цикл
							ПисьмоОбъект.ДополнительныеСвойства.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
						КонецЦикла;
						ВстроеннаяПочтаСервер.ВыполнитьДействияПравилаДляИсходящих(ПисьмоОбъект, ПравилоСсылка.Ссылка, ТаблицаПараметров, Истина, ДействияВыполнялись, НеобходимоЗаписатьПисьмо);
						Если ДействияВыполнялись И НеобходимоЗаписатьПисьмо Тогда
							ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
							ПисьмоОбъект.Записать();
							РазблокироватьДанныеДляРедактирования(Выборка.Ссылка);
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
			Исключение
				Инфо = ИнформацияОбОшибке();
				СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка при обработке письма правилами: 
						|%1'"),
					ПодробноеПредставлениеОшибки(Инфо));
				Почта.ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, ПисьмоОбъект.Ссылка);	
				РазблокироватьДанныеДляРедактирования(ПисьмоОбъект.Ссылка);
			КонецПопытки;
			
			Если ВыводитьСообщения Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("###" + Формат(Сч * 100 / КоличествоИтераций, "ЧДЦ=0; ЧН=; ЧГ="));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;		
	
КонецПроцедуры

Процедура СформироватьУсловияПоПисьму(
	Письмо,
	СписокУсловия,
	ДляВходящихПисем,
	ДляИсходящихПисем) Экспорт
	
	СписокУсловия.Очистить();
	
	Если ДляВходящихПисем Тогда
		
		ДобавитьУсловие(
		    СписокУсловия,
			Перечисления.ВидыУсловийОтбораВходящихПисем.ТемаСодержитУказанныеСлова,
			Письмо.Тема);
			
		ПредставлениеАдресата = Письмо.ОтправительАдресат.Адрес;	
		ДобавитьУсловие(
		    СписокУсловия,
			Перечисления.ВидыУсловийОтбораВходящихПисем.АдресОтправителяСодержитУказанныеСлова,
			ПредставлениеАдресата);
			
		АдресованоМне = Ложь;
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
		Если АдресованоМне Тогда
			Если Письмо.ПолучателиПисьма.Количество() = 1 Тогда
				ДобавитьУсловие(
				    СписокУсловия,
					Перечисления.ВидыУсловийОтбораВходящихПисем.АдресованоТолькоМне,
					Истина);
			Иначе
				ДобавитьУсловие(
				    СписокУсловия,
					Перечисления.ВидыУсловийОтбораВходящихПисем.АдресованоМне,
					Истина);	
			КонецЕсли;
		Иначе
			ДобавитьУсловие(
			    СписокУсловия,
				Перечисления.ВидыУсловийОтбораВходящихПисем.АдресованоМне,
				Неопределено);	
		КонецЕсли;
		
		ДобавитьУсловие(
		    СписокУсловия,
			Перечисления.ВидыУсловийОтбораВходящихПисем.ИмеетВложения,
			?(Письмо.ЕстьВложения, Письмо.ЕстьВложения, Неопределено));
			
	ИначеЕсли ДляИсходящихПисем Тогда
		
		ДобавитьУсловие(
		    СписокУсловия,
			Перечисления.ВидыУсловийОтбораИсходящихПисем.ТемаСодержитУказанныеСлова,
			Письмо.Тема);
			
		Если Письмо.ПолучателиПисьма.Количество() <> 0 Тогда	
				
			ПредставлениеПолучателя = Письмо.ПолучателиПисьма[0].Адресат.Адрес;
				
			ДобавитьУсловие(
			    СписокУсловия,
				Перечисления.ВидыУсловийОтбораИсходящихПисем.ОтправленоНаУказанныеАдреса,
				ПредставлениеПолучателя);
				
		КонецЕсли;	
			
		ПисьмоОснование = Письмо.ПисьмоОснование;
		ТипОтвета = Письмо.ТипОтвета;
		
		Если ТипОтвета = Перечисления.ТипыОтвета.ОтветНаПисьмо Тогда
			ДобавитьУсловие(
			    СписокУсловия,
				Перечисления.ВидыУсловийОтбораИсходящихПисем.ЯвляетсяОтветомНаПисьмо,
				Истина);	
		ИначеЕсли ТипОтвета = Перечисления.ТипыОтвета.ПересылкаПисьма Тогда
			Если ТипЗнч(ПисьмоОснование) = Тип("ДокументСсылка.ВходящееПисьмо") Тогда
				ДобавитьУсловие(
				    СписокУсловия,
					Перечисления.ВидыУсловийОтбораИсходящихПисем.ПересылаетВходящееПисьмо,
					Истина);
			ИначеЕсли ТипЗнч(ПисьмоОснование) = Тип("ДокументСсылка.ИсходящееПисьмо") Тогда
				ДобавитьУсловие(
				    СписокУсловия,
					Перечисления.ВидыУсловийОтбораИсходящихПисем.ПересылаетИсходящееПисьмо,
					Истина);	
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;	
	
КонецПроцедуры

Процедура СформироватьДействияПоПисьму(
	Письмо,
	СписокДействия,
	ДляВходящихПисем,
	ДляИсходящихПисем) Экспорт
	
	СписокДействия.Очистить();
	
	Флаг = РегистрыСведений.ФлагиОбъектов.ПолучитьФлаг(
			Письмо,
			ПользователиКлиентСервер.ТекущийПользователь());
			
	Если ДляВходящихПисем Тогда
		
		ПисьмоПрочтено = РегистрыСведений.СведенияОПрочтении.ОбъектБылПрочтен(Письмо);
	
		ДобавитьДействие(
			СписокДействия,
			Перечисления.ВидыДействийПриОбработкеВходящихПисем.УстановитьПометкуПрочтения,
			?(ПисьмоПрочтено, ПисьмоПрочтено, Неопределено));
			
		ДобавитьДействие(
			СписокДействия,
			Перечисления.ВидыДействийПриОбработкеВходящихПисем.ПереместитьВУказаннуюПапку,
			Письмо.Папка);
			
		ДобавитьДействие(
			СписокДействия,
			Перечисления.ВидыДействийПриОбработкеВходящихПисем.УстановитьУказанныйФлаг,
			Флаг);	
			
	ИначеЕсли ДляИсходящихПисем Тогда
		
		ДобавитьДействие(
			СписокДействия,
			Перечисления.ВидыДействийПриОбработкеИсходящихПисем.ПереместитьВУказаннуюПапку,
			Письмо.Папка);
			
		ДобавитьДействие(
			СписокДействия,
			Перечисления.ВидыДействийПриОбработкеИсходящихПисем.УстановитьУказанныйФлаг,
			Флаг);
				
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьУсловие(СписокУсловия, Вид, Значение) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Вид", Вид);
	Структура.Вставить("Значение", Значение);
	СписокУсловия.Добавить(Структура);		
	
КонецПроцедуры

Процедура ДобавитьДействие(СписокДействия, Вид, Значение) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Вид", Вид);
	Структура.Вставить("Значение", Значение);
	СписокДействия.Добавить(Структура);		
	
КонецПроцедуры
